#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001][0m
[0m[1mmodule.data_landing_zone.azurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr][0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001][0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw][0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/StorageSubnet][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.azapi_resource.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet][0m
[0m[1mmodule.data_landing_zone.azapi_resource.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/PowerBiSubnet][0m
[0m[1mmodule.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-adf001-portal-pe][0m
[0m[1mmodule.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-adf001-datafactory-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/bd6db281-07dd-96b1-7603-c9748a1282b9][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/4f733c27-f111-eedc-022d-2f33b66bcbb4][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/c89559ca-fd68-ff92-7887-b66a2f3ef328][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/9ef4f886-47fa-19d4-feba-3470985dfbeb][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-table-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/608450b1-b123-94c3-bfe8-c0ca6c91b63c][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-queue-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/providers/Microsoft.Authorization/roleAssignments/331c4bb7-0736-192a-57e8-1dee633b30ff][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/providers/Microsoft.Authorization/roleAssignments/23d3c5a2-598e-8a90-3aeb-d398f5a45297][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/providers/Microsoft.Authorization/roleAssignments/4d9cc4ea-83d6-bd62-95fd-ec30b84abb37][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstwsp.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb][0m
[0m[1mmodule.data_landing_zone.module.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.data_landing_zone.module.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstcur.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstenr.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/inboundNatPools/mydlz02-dev-shir001-natpool][0m
[0m[1mmodule.data_landing_zone.module.shir_001.data.azurerm_data_factory.data_factory: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/backendAddressPools/mydlz02-dev-shir001-backendaddresspool][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/probes/mydlz02-dev-shir001-probe][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001/integrationruntimes/mydlz02-dev-shir001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-kv001-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstraw.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/loadBalancingRules/mydlz02-dev-shir001-rule][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz02-dev-shir001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-kv001-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-aut-dbw001][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-web-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-exp-dbw001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=3462167891288306|65114305-ebd5-447d-860d-6396356927b1][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=30644216E4004C6D][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=30644216E4004C6E][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.databricks_group.group[0]: Read complete after 1s [id=377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_mws_permission_assignment.permission_assignment: Refreshing state... [id=3462167891288306|377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=6259073605517063|65114305-ebd5-447d-860d-6396356927b1][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=30644216E4004C6C][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=30644216E4004C6B][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.databricks_group.group[0]: Read complete after 0s [id=377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_mws_permission_assignment.permission_assignment: Refreshing state... [id=6259073605517063|377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.time_sleep.sleep: Refreshing state... [id=2023-05-30T10:45:33Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_secret_acl.secret_acl[0]: Refreshing state... [id=platform-secret-scope|||test][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.time_sleep.sleep: Refreshing state... [id=2023-05-30T10:45:33Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_acl.secret_acl[0]: Refreshing state... [id=platform-secret-scope|||test][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].time_rotating.rotation: Refreshing state... [id=2023-05-30T10:45:35Z][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_enriched: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_client_config.current: Read complete after 0s [id=3556be79-2979-4b19-a1af-4dd4e6d9ed7e-baaa7885-90d9-49a6-bff0-c12ec738bf9b-e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_curated: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_raw: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azuread_application.application[0]: Refreshing state... [id=cdcd8d1a-66b6-4a51-943b-a51cf1edc6e0][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_group.security_group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_databricks_access_connector.databricks_access_connector[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_user_assigned_identity.user_assigned_identity[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/test-prd-uai001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_workspace: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_curated: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/37aff545-3aba-ffb9-75fa-64499b22ea24][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_enriched: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_raw: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/93dd0189-a222-9a01-40e2-c43df88502d6][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=6655f06b-8ae3-46fb-8260-d87fbecfd1a7][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_group.security_group[0]: Read complete after 1s [id=238f1be3-8722-41ab-ac00-0ac9b8703915][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/7e008eb9-432f-0f85-0c67-22d41b3cf46f][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/e92726fb-85ec-1a74-3761-974ea059b184][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.service_principal_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/433e908e-a919-0fcb-ebe6-f49f4daf6fd6][0m
[0m[1mmodule.data_landing_zone.module.data_products["test.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=6655f06b-8ae3-46fb-8260-d87fbecfd1a7/password/c8ec2f99-ef5f-49cb-9484-73831944d671][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azapi_resource.subnets["DataProductSubnet-dptest-prd1"][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnets" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.48.96/28"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DataProductSubnet-dptest-prd1"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azuread_application.application[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_application" "application" {
      [32m+[0m[0m app_role_ids                = (known after apply)
      [32m+[0m[0m application_id              = (known after apply)
      [32m+[0m[0m description                 = "Data Product Application - dptest-prd"
      [32m+[0m[0m disabled_by_microsoft       = (known after apply)
      [32m+[0m[0m display_name                = "dptest-prd"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m logo_url                    = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids = (known after apply)
      [32m+[0m[0m object_id                   = (known after apply)
      [32m+[0m[0m owners                      = [
          [32m+[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ]
      [32m+[0m[0m prevent_duplicate_names     = false
      [32m+[0m[0m publisher_domain            = (known after apply)
      [32m+[0m[0m sign_in_audience            = "AzureADMyOrg"
      [32m+[0m[0m tags                        = (known after apply)
      [32m+[0m[0m template_id                 = (known after apply)

      [32m+[0m[0m feature_tags {
          [32m+[0m[0m custom_single_sign_on = false
          [32m+[0m[0m enterprise            = false
          [32m+[0m[0m gallery               = false
          [32m+[0m[0m hide                  = false
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal.service_principal[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_service_principal" "service_principal" {
      [32m+[0m[0m account_enabled              = true
      [32m+[0m[0m app_role_assignment_required = false
      [32m+[0m[0m app_role_ids                 = (known after apply)
      [32m+[0m[0m app_roles                    = (known after apply)
      [32m+[0m[0m application_id               = (known after apply)
      [32m+[0m[0m application_tenant_id        = (known after apply)
      [32m+[0m[0m description                  = "Data Product Service Principal - dptest-prd"
      [32m+[0m[0m display_name                 = (known after apply)
      [32m+[0m[0m homepage_url                 = (known after apply)
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m logout_url                   = (known after apply)
      [32m+[0m[0m notes                        = "Azure RBAC"
      [32m+[0m[0m oauth2_permission_scope_ids  = (known after apply)
      [32m+[0m[0m oauth2_permission_scopes     = (known after apply)
      [32m+[0m[0m object_id                    = (known after apply)
      [32m+[0m[0m owners                       = [
          [32m+[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ]
      [32m+[0m[0m redirect_uris                = (known after apply)
      [32m+[0m[0m saml_metadata_url            = (known after apply)
      [32m+[0m[0m service_principal_names      = (known after apply)
      [32m+[0m[0m sign_in_audience             = (known after apply)
      [32m+[0m[0m tags                         = (known after apply)
      [32m+[0m[0m type                         = (known after apply)

      [32m+[0m[0m feature_tags {
          [32m+[0m[0m custom_single_sign_on = false
          [32m+[0m[0m enterprise            = false
          [32m+[0m[0m gallery               = false
          [32m+[0m[0m hide                  = false
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal_password.service_principal_password[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_service_principal_password" "service_principal_password" {
      [32m+[0m[0m display_name         = "Azure RBAC"
      [32m+[0m[0m end_date             = (known after apply)
      [32m+[0m[0m end_date_relative    = "2400h"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m key_id               = (known after apply)
      [32m+[0m[0m rotate_when_changed  = (known after apply)
      [32m+[0m[0m service_principal_id = (known after apply)
      [32m+[0m[0m start_date           = (known after apply)
      [32m+[0m[0m value                = (sensitive value)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_databricks_access_connector.databricks_access_connector[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westeurope"
      [32m+[0m[0m name                = "dptest-prd-dbac001"
      [32m+[0m[0m resource_group_name = "dptest-prd-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "westeurope"
      [32m+[0m[0m name                            = "dptest-prd-vault001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "dptest-prd-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
      [32m+[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_display_name[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_security_group_display_name" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "securityGroupDisplayName"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_object_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_security_group_object_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "securityGroupObjectId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_client_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "servicePrincipalClientId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_secret[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_client_secret" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "servicePrincipalClientSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_object_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_object_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "servicePrincipalObjectId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_tenant_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_tenant_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "servicePrincipalTenantId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "dptest-prd-vault001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westeurope"
      [32m+[0m[0m name                          = "dptest-prd-vault001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "dptest-prd-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "dptest-prd-vault001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "dptest-prd-vault001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_resource_group.data_product_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "data_product_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westeurope"
      [32m+[0m[0m name     = "dptest-prd-rg"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "dbac_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "dbac_roleassignment_storage_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Delegator"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_resource_group" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_storage_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Reader"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_subnets" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_resource_group[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_resource_group" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_subnets" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_resource_group" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_subnets" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_storage_container.container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "container_workspace" {
      [32m+[0m[0m container_access_type   = "private"
      [32m+[0m[0m has_immutability_policy = (known after apply)
      [32m+[0m[0m has_legal_hold          = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m metadata                = (known after apply)
      [32m+[0m[0m name                    = "dptestprd"
      [32m+[0m[0m resource_manager_id     = (known after apply)
      [32m+[0m[0m storage_account_name    = "mydlz02devstwsp"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_user_assigned_identity.user_assigned_identity[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westeurope"
      [32m+[0m[0m name                = "dptest-prd-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "dptest-prd-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_catalog.automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "automation_catalog" {
      [32m+[0m[0m comment       = "Data Product Catalog - dptest-prd"
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m metastore_id  = "65114305-ebd5-447d-860d-6396356927b1"
      [32m+[0m[0m name          = "dptest-prd"
      [32m+[0m[0m owner         = (known after apply)
      [32m+[0m[0m properties    = {
          [32m+[0m[0m "purpose" = "Data Product Catalog - dptest-prd"
        }
      [32m+[0m[0m storage_root  = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_external_location.automation_external_location[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "automation_external_location" {
      [32m+[0m[0m comment         = "Default Storage for dptest-prd Data Product"
      [32m+[0m[0m credential_name = "dptest-prd"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "dptest-prd"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_grants.grants_automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_automation_catalog" {
      [32m+[0m[0m catalog = "dptest-prd"
      [32m+[0m[0m id      = (known after apply)

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "test"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "ALL_PRIVILEGES",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_storage_credential.automation_storage_credential[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "automation_storage_credential" {
      [32m+[0m[0m comment      = "Managed identity credential for dptest-prd Data Product"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m name         = "dptest-prd"
      [32m+[0m[0m owner        = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = (known after apply)
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].time_rotating.rotation[0m will be created
[0m  [32m+[0m[0m resource "time_rotating" "rotation" {
      [32m+[0m[0m day              = (known after apply)
      [32m+[0m[0m hour             = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m minute           = (known after apply)
      [32m+[0m[0m month            = (known after apply)
      [32m+[0m[0m rfc3339          = (known after apply)
      [32m+[0m[0m rotation_days    = 90
      [32m+[0m[0m rotation_rfc3339 = (known after apply)
      [32m+[0m[0m second           = (known after apply)
      [32m+[0m[0m unix             = (known after apply)
      [32m+[0m[0m year             = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azuread_application.application[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azuread_application" "application" {
      [31m-[0m[0m app_role_ids                   = {} [90m-> null[0m[0m
      [31m-[0m[0m application_id                 = "a3a7d06e-b771-4607-8eec-56a4531c353b" [90m-> null[0m[0m
      [31m-[0m[0m description                    = "Data Product Application - test-prd" [90m-> null[0m[0m
      [31m-[0m[0m device_only_auth_enabled       = false [90m-> null[0m[0m
      [31m-[0m[0m disabled_by_microsoft          = "<nil>" [90m-> null[0m[0m
      [31m-[0m[0m display_name                   = "test-prd" [90m-> null[0m[0m
      [31m-[0m[0m fallback_public_client_enabled = false [90m-> null[0m[0m
      [31m-[0m[0m group_membership_claims        = [] [90m-> null[0m[0m
      [31m-[0m[0m id                             = "cdcd8d1a-66b6-4a51-943b-a51cf1edc6e0" [90m-> null[0m[0m
      [31m-[0m[0m identifier_uris                = [] [90m-> null[0m[0m
      [31m-[0m[0m oauth2_permission_scope_ids    = {} [90m-> null[0m[0m
      [31m-[0m[0m oauth2_post_response_required  = false [90m-> null[0m[0m
      [31m-[0m[0m object_id                      = "cdcd8d1a-66b6-4a51-943b-a51cf1edc6e0" [90m-> null[0m[0m
      [31m-[0m[0m owners                         = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] [90m-> null[0m[0m
      [31m-[0m[0m prevent_duplicate_names        = false [90m-> null[0m[0m
      [31m-[0m[0m publisher_domain               = "MngEnv496918.onmicrosoft.com" [90m-> null[0m[0m
      [31m-[0m[0m sign_in_audience               = "AzureADMyOrg" [90m-> null[0m[0m
      [31m-[0m[0m tags                           = [] [90m-> null[0m[0m

      [31m-[0m[0m api {
          [31m-[0m[0m known_client_applications      = [] [90m-> null[0m[0m
          [31m-[0m[0m mapped_claims_enabled          = false [90m-> null[0m[0m
          [31m-[0m[0m requested_access_token_version = 1 [90m-> null[0m[0m
        }

      [31m-[0m[0m feature_tags {
          [31m-[0m[0m custom_single_sign_on = false [90m-> null[0m[0m
          [31m-[0m[0m enterprise            = false [90m-> null[0m[0m
          [31m-[0m[0m gallery               = false [90m-> null[0m[0m
          [31m-[0m[0m hide                  = false [90m-> null[0m[0m
        }

      [31m-[0m[0m optional_claims {
        }

      [31m-[0m[0m public_client {
          [31m-[0m[0m redirect_uris = [] [90m-> null[0m[0m
        }

      [31m-[0m[0m single_page_application {
          [31m-[0m[0m redirect_uris = [] [90m-> null[0m[0m
        }

      [31m-[0m[0m web {
          [31m-[0m[0m redirect_uris = [] [90m-> null[0m[0m

          [31m-[0m[0m implicit_grant {
              [31m-[0m[0m access_token_issuance_enabled = false [90m-> null[0m[0m
              [31m-[0m[0m id_token_issuance_enabled     = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azuread_service_principal.service_principal[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azuread_service_principal" "service_principal" {
      [31m-[0m[0m account_enabled              = true [90m-> null[0m[0m
      [31m-[0m[0m alternative_names            = [] [90m-> null[0m[0m
      [31m-[0m[0m app_role_assignment_required = false [90m-> null[0m[0m
      [31m-[0m[0m app_role_ids                 = {} [90m-> null[0m[0m
      [31m-[0m[0m app_roles                    = [] [90m-> null[0m[0m
      [31m-[0m[0m application_id               = "a3a7d06e-b771-4607-8eec-56a4531c353b" [90m-> null[0m[0m
      [31m-[0m[0m application_tenant_id        = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
      [31m-[0m[0m description                  = "Data Product Service Principal - test-prd" [90m-> null[0m[0m
      [31m-[0m[0m display_name                 = "test-prd" [90m-> null[0m[0m
      [31m-[0m[0m id                           = "6655f06b-8ae3-46fb-8260-d87fbecfd1a7" [90m-> null[0m[0m
      [31m-[0m[0m notes                        = "Azure RBAC" [90m-> null[0m[0m
      [31m-[0m[0m notification_email_addresses = [] [90m-> null[0m[0m
      [31m-[0m[0m oauth2_permission_scope_ids  = {} [90m-> null[0m[0m
      [31m-[0m[0m oauth2_permission_scopes     = [] [90m-> null[0m[0m
      [31m-[0m[0m object_id                    = "6655f06b-8ae3-46fb-8260-d87fbecfd1a7" [90m-> null[0m[0m
      [31m-[0m[0m owners                       = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] [90m-> null[0m[0m
      [31m-[0m[0m redirect_uris                = [] [90m-> null[0m[0m
      [31m-[0m[0m service_principal_names      = [] [90m-> null[0m[0m
      [31m-[0m[0m sign_in_audience             = "AzureADMyOrg" [90m-> null[0m[0m
      [31m-[0m[0m tags                         = [] [90m-> null[0m[0m
      [31m-[0m[0m type                         = "Application" [90m-> null[0m[0m

      [31m-[0m[0m feature_tags {
          [31m-[0m[0m custom_single_sign_on = false [90m-> null[0m[0m
          [31m-[0m[0m enterprise            = false [90m-> null[0m[0m
          [31m-[0m[0m gallery               = false [90m-> null[0m[0m
          [31m-[0m[0m hide                  = false [90m-> null[0m[0m
        }

      [31m-[0m[0m features {
          [31m-[0m[0m custom_single_sign_on_app = false [90m-> null[0m[0m
          [31m-[0m[0m enterprise_application    = false [90m-> null[0m[0m
          [31m-[0m[0m gallery_application       = false [90m-> null[0m[0m
          [31m-[0m[0m visible_to_users          = true [90m-> null[0m[0m
        }

      [31m-[0m[0m saml_single_sign_on {}
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azuread_service_principal_password.service_principal_password[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azuread_service_principal_password" "service_principal_password" {
      [31m-[0m[0m display_name         = "Azure RBAC" [90m-> null[0m[0m
      [31m-[0m[0m end_date             = "2023-09-07T10:45:37Z" [90m-> null[0m[0m
      [31m-[0m[0m end_date_relative    = "2400h" [90m-> null[0m[0m
      [31m-[0m[0m id                   = "6655f06b-8ae3-46fb-8260-d87fbecfd1a7/password/c8ec2f99-ef5f-49cb-9484-73831944d671" [90m-> null[0m[0m
      [31m-[0m[0m key_id               = "c8ec2f99-ef5f-49cb-9484-73831944d671" [90m-> null[0m[0m
      [31m-[0m[0m rotate_when_changed  = {
          [31m-[0m[0m "rotation" = "2023-05-30T10:45:35Z"
        } [90m-> null[0m[0m
      [31m-[0m[0m service_principal_id = "6655f06b-8ae3-46fb-8260-d87fbecfd1a7" [90m-> null[0m[0m
      [31m-[0m[0m start_date           = "2023-05-30T10:45:38Z" [90m-> null[0m[0m
      [31m-[0m[0m value                = (sensitive value) [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_databricks_access_connector.databricks_access_connector[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001" [90m-> null[0m[0m
      [31m-[0m[0m location            = "westeurope" [90m-> null[0m[0m
      [31m-[0m[0m name                = "test-prd-dbac001" [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name = "test-prd-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags                = {
          [31m-[0m[0m "costCenter" = "ABCD1234"
        } [90m-> null[0m[0m

      [31m-[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [31m-[0m[0m principal_id = "2b8b63dd-aa25-4dc7-abc9-28dd05f569d0" [90m-> null[0m[0m
          [31m-[0m[0m tenant_id    = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
          [31m-[0m[0m type         = "SystemAssigned" [90m-> null[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_resource_group.data_product_rg[0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_resource_group" "data_product_rg" {
      [31m-[0m[0m id       = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg" [90m-> null[0m[0m
      [31m-[0m[0m location = "westeurope" [90m-> null[0m[0m
      [31m-[0m[0m name     = "test-prd-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags     = {
          [31m-[0m[0m "costCenter" = "ABCD1234"
        } [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "dbac_roleassignment_storage_workspace" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/93dd0189-a222-9a01-40e2-c43df88502d6" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "93dd0189-a222-9a01-40e2-c43df88502d6" [90m-> null[0m[0m
      [31m-[0m[0m principal_id         = "2b8b63dd-aa25-4dc7-abc9-28dd05f569d0" [90m-> null[0m[0m
      [31m-[0m[0m principal_type       = "ServicePrincipal" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name = "Storage Blob Delegator" [90m-> null[0m[0m
      [31m-[0m[0m scope                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_resource_group" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/7e008eb9-432f-0f85-0c67-22d41b3cf46f" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "7e008eb9-432f-0f85-0c67-22d41b3cf46f" [90m-> null[0m[0m
      [31m-[0m[0m principal_id         = "238f1be3-8722-41ab-ac00-0ac9b8703915" [90m-> null[0m[0m
      [31m-[0m[0m principal_type       = "Group" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name = "Contributor" [90m-> null[0m[0m
      [31m-[0m[0m scope                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_storage_workspace" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/e92726fb-85ec-1a74-3761-974ea059b184" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "e92726fb-85ec-1a74-3761-974ea059b184" [90m-> null[0m[0m
      [31m-[0m[0m principal_id         = "238f1be3-8722-41ab-ac00-0ac9b8703915" [90m-> null[0m[0m
      [31m-[0m[0m principal_type       = "Group" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name = "Reader" [90m-> null[0m[0m
      [31m-[0m[0m scope                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.service_principal_roleassignment_resource_group[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_resource_group" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/433e908e-a919-0fcb-ebe6-f49f4daf6fd6" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "433e908e-a919-0fcb-ebe6-f49f4daf6fd6" [90m-> null[0m[0m
      [31m-[0m[0m principal_id         = "6655f06b-8ae3-46fb-8260-d87fbecfd1a7" [90m-> null[0m[0m
      [31m-[0m[0m principal_type       = "ServicePrincipal" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name = "Contributor" [90m-> null[0m[0m
      [31m-[0m[0m scope                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_resource_group" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/37aff545-3aba-ffb9-75fa-64499b22ea24" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "37aff545-3aba-ffb9-75fa-64499b22ea24" [90m-> null[0m[0m
      [31m-[0m[0m principal_id         = "ec494d1f-5935-4b41-8c8c-07cc5b9e4d5d" [90m-> null[0m[0m
      [31m-[0m[0m principal_type       = "ServicePrincipal" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name = "Contributor" [90m-> null[0m[0m
      [31m-[0m[0m scope                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].azurerm_user_assigned_identity.user_assigned_identity[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [31m-[0m[0m client_id           = "562c2e12-a436-4e69-99e9-200a664ae857" [90m-> null[0m[0m
      [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/test-prd-uai001" [90m-> null[0m[0m
      [31m-[0m[0m location            = "westeurope" [90m-> null[0m[0m
      [31m-[0m[0m name                = "test-prd-uai001" [90m-> null[0m[0m
      [31m-[0m[0m principal_id        = "ec494d1f-5935-4b41-8c8c-07cc5b9e4d5d" [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name = "test-prd-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags                = {
          [31m-[0m[0m "costCenter" = "ABCD1234"
        } [90m-> null[0m[0m
      [31m-[0m[0m tenant_id           = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0][0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "databricks_storage_credential" "automation_storage_credential" {
      [31m-[0m[0m comment      = "Managed identity credential for test-prd Data Product" [90m-> null[0m[0m
      [31m-[0m[0m id           = "test-prd" [90m-> null[0m[0m
      [31m-[0m[0m metastore_id = "65114305-ebd5-447d-860d-6396356927b1" [90m-> null[0m[0m
      [31m-[0m[0m name         = "test-prd" [90m-> null[0m[0m
      [31m-[0m[0m owner        = "baaa7885-90d9-49a6-bff0-c12ec738bf9b" [90m-> null[0m[0m

      [31m-[0m[0m azure_managed_identity {
          [31m-[0m[0m access_connector_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001" [90m-> null[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.data_products["test.yml"].time_rotating.rotation[0m will be [1m[31mdestroyed[0m
  # (because module.data_landing_zone.module.data_products["test.yml"] is not in configuration)
[0m  [31m-[0m[0m resource "time_rotating" "rotation" {
      [31m-[0m[0m day              = 28 [90m-> null[0m[0m
      [31m-[0m[0m hour             = 10 [90m-> null[0m[0m
      [31m-[0m[0m id               = "2023-05-30T10:45:35Z" [90m-> null[0m[0m
      [31m-[0m[0m minute           = 45 [90m-> null[0m[0m
      [31m-[0m[0m month            = 8 [90m-> null[0m[0m
      [31m-[0m[0m rfc3339          = "2023-05-30T10:45:35Z" [90m-> null[0m[0m
      [31m-[0m[0m rotation_days    = 90 [90m-> null[0m[0m
      [31m-[0m[0m rotation_rfc3339 = "2023-08-28T10:45:35Z" [90m-> null[0m[0m
      [31m-[0m[0m second           = 35 [90m-> null[0m[0m
      [31m-[0m[0m unix             = 1693219535 [90m-> null[0m[0m
      [31m-[0m[0m year             = 2023 [90m-> null[0m[0m
    }

[1mPlan:[0m 37 to add, 0 to change, 13 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "databricks_account_id"
[33m│[0m [0mbut a value was found in file "vars.dev.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>